{
  "_meta": {
    "maxChars": {
      "welcome": 20,
      "readyToPlay": 20,
      "pressContinue": 50,
      "greatJob": 20,
      "onePlusOne": 30,
	  
	  "btnPlay": 5,
	  "btnOk": 4,
	  "score": 7,
	  
	  "opening_0": 121,
	  "opening_1": 121,
	  "opening_2": 121,
	  "opening_3": 121,
	  
	  "egghatched_0": 121,
	  "egghatched_1": 121,
	  "egghatched_2": 121,
	  "egghatched_3": 121,
	  
	  "foundcaterpillar1_0": 121,
	  "foundcaterpillar1_1": 121,
	  "foundcaterpillar1_2": 121,
	  "foundcaterpillar1_3": 121,
	  
	  "foundflowera_0": 121,
	  "foundflowera_1": 121,
	  "foundflowera_2": 121,
	  
	  "foundcaterpillar2_0": 121,
	  "foundcaterpillar2_1": 121,
	  
	  "foundbutterfly_0": 121,
	  "foundbutterfly_1": 121,
	  "foundbutterfly_2": 121,
	  "foundbutterfly_3": 121,
	  
	  "foundflowerb_0": 121,
	  "foundflowerb_1": 121,
	  
	  "foundfemalechicken_0": 121,
	  "foundfemalechicken_1": 121,
	  "foundfemalechicken_2": 121,
	  "foundfemalechicken_3": 121,
	  
	  "oldage_0": 121,
	  "oldage_1": 121,
	  "oldage_2": 121,
	  "oldage_3": 121,
	  "oldage_4": 121
    }
  },
  "en": {
	"btnPlay": "PLAY",
	"btnOk": "OK",
	"score": "Score",
	
	"opening_0": "Hello, and welcome to the chicken barn! Do you like chickens?",
	"opening_1": "We’ll play as a chicken, and let’s see what can we learn from this barn!",
	"opening_2": "You might need further explanation ons everal things in this game, so be sure to note them down and discuss it after the game with your teacher!"
	"opening_3": "Now, let’s hatch a new chicken from this egg. It’s almost time to hatch. Let's give it some help!",
	"opening_4": "Tap the left and right buttons continuously to hatch it.",
	
	"egghatched_0": "Woohoo! Welcome to the world, little chicken.",
	"egghatched_1": "Now, like other living being, this chicken will need food to grow.",
	"egghatched_2": "So let’s get some rice to eat!",
	"egghatched_3": "Tap anywhere to move the chicken in that direction, or hold and drag to make it move continuously. You can also use arrow keyboard to move.",
	"egghatched_4": "Eat many food, collect all the items, and learn about many things in this barn.",
	
			
	"foundcaterpillar1_0": "This is a caterpillar. Nice finding!",
	"foundcaterpillar1_1": "Just like your little chicken, this caterpillar is also in the beginning of their life cycle.",
	"foundcaterpillar1_2": "They also hatched from an egg, just like this chicken.",
	"foundcaterpillar1_3": "Be sure to let me know if you find anything else interesting!",
	
	"foundflowera_0": "Oooh, a flower bud!",
	"foundflowera_1": "Just like your little chicken, this flower is in the beginning of their life.",
	"foundflowera_2": "They didn’t hatch from an egg, though. Ask your teacher after playing about where they come from!",
	
	"foundcaterpillar2_0": "After living healthily for a few months, your little chicken grows into an adult chicken!",
	"foundcaterpillar2_1": "When organisms grow, they become larger over time. Look at how big you’ve become!",
	
	"foundbutterfly_0": "This is a butterfly. It’s beautiful!",
	"foundbutterfly_1": "Just as your adult chicken comes from a little chicken, this butterfly comes from a little caterpillar.",
	"foundbutterfly_2": "What’s interesting, though, is that it becomes a cocoon before becoming a butterfly.",
	"foundbutterfly_3": "Some insects have a cocoon phase, some don’t. Do you know about that?",
	
	"foundflowerb_0": "Look! This flower has blossomed beautifully!",
	"foundflowerb_1": "You can say that this flower is entering its adult state, just like your chicken!",
	
	"foundfemalechicken_0": "Your chicken has found a lovely mate. Like other organism, once they reach adult state, they will reproduce!",
	"foundfemalechicken_1": "Reproduction is essential to the continued existence of every kind of organism.",
	"foundfemalechicken_2": "Plants reproduce too, just like the flower you’ve found before. But they reproduce differently than animals.",
	"foundfemalechicken_3": "Ask your teacher about various reproduction processes after playing this!",
	
	"oldage_0": "Your chicken has lived a long life, and has finally reached its final age.",
	"oldage_1": "That’s a pity, but that’s how the life cycle usually goes.",
	"oldage_2": "All organisms share similar life cycle patterns such as birth, growth, development into adults, reproduction, and death.",
	"oldage_3": "It’s the same with the flower and butterfly you found before, too.",
	"oldage_4": "We hope you learned something from this game!"
  }
}
